
## Plan Result

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/10634007631)


<pre><code>Plan: 1 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * local_file.index_page
* Update
  * aws_lambda_function.lambda
  * aws_lambda_function.scan
  * aws_s3_bucket.images
  * aws_s3_bucket.website


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-refactor-use-textractor-user_registration_consulcam"
      ~ last_modified                  = "2024-08-30T13:44:44.906+0000" -> (known after apply)
      ~ source_code_hash               = "of7pAxdRTKqmNZNATcBDtGsyqo8r6K8OJ1gB2tNi6qQ=" -> "aG/693OgtesclFbtQG3JpowPoOxVEki6ETbi5wlrhnw="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "mtchoun-mouh-refactor-use-textractor-scan_user_consulcam"
      ~ last_modified                  = "2024-08-30T13:44:33.940+0000" -> (known after apply)
      ~ source_code_hash               = "of7pAxdRTKqmNZNATcBDtGsyqo8r6K8OJ1gB2tNi6qQ=" -> "aG/693OgtesclFbtQG3JpowPoOxVEki6ETbi5wlrhnw="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-refactor-use-textractor-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (11 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-refactor-use-textractor-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (13 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 1 to add, 4 to change, 0 to destroy.

```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":186,"Program":"tfcmt","SHA1":"2b8d48a319fed9ff3f3047d78760cb4220eb11bc","Vars":{},"WorkflowName":"Deploy cases"} -->